{"format": "layers-model", "generatedBy": "keras v3.5.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_8", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "input_layer_9"}, "name": "input_layer_9", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12], "dtype": "float32", "keras_history": ["input_layer_9", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12], "dtype": "float32", "keras_history": ["input_layer_9", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_24", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_26", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "fuel_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fuel_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_25", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "method_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "method_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_27", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_9", 0, 0]], "output_layers": [["fuel_output", 0, 0], ["method_output", 0, 0]]}}, "training_config": {"loss": {"fuel_output": "categorical_crossentropy", "method_output": "categorical_crossentropy"}, "loss_weights": null, "metrics": {"fuel_output": ["accuracy"], "method_output": ["accuracy"]}, "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_24/kernel", "shape": [12, 128], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [12, 128], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_27/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_27/bias", "shape": [64], "dtype": "float32"}, {"name": "fuel_output/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "fuel_output/bias", "shape": [5], "dtype": "float32"}, {"name": "method_output/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "method_output/bias", "shape": [1], "dtype": "float32"}]}]}